Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: The message authentication algorithm and key are negotiated during key exchange.
ja: メッセージ認証アルゴリズムと鍵は, 鍵交換の間に取り決められる.

source: The reader is reminded that SSH requires that the data to be encrypted MUST be padded out to a multiple of the block size (16-octets for AES-GCM).
ja: 読者は, 暗号化されるデータはブロックサイズ (AES-GCM では 16-オクテット)の倍数にパディングされなければならないことをSSHが要求していることに注意.

source: Additional methods may be defined as specified in [SSH-NUMBERS].
ja: 追加の方法が, [SSH-NUMBERS] で定義されるかもしれない.

source: There are two classes of attack on Arcfour described in [MIRONOV].
ja: [MIRONOV]ではArcfourへの2つの種類の攻撃が記述されている.

source: The following table identifies the initial assignments of the opcode values that are used in the 'encoded terminal modes' value.
ja: 次の表で, 'encoded terminal modes' の値に使われるオペコードの値の初期の割り当てを示す.

source: They are stored as a uint32 containing its length (number of bytes that follow) and zero (= empty string) or more bytes that are the value of the string.
ja: stringは, その長さ(値のbyte数)のuint32とその値のbyte列で格納される. 空のstringの場合は, 値がない

source: Debug messages can be disabled (during user authentication phase) if high security is required.
ja: 高いセキュリティが要求されるなら, デバッグメッセージは(ユーザ認証のフェイズで)無効にできるようにする.

source: The opcode values consist of a single byte and are in the range of 1 to 255.
ja: オペコードの値は, 1から255の範囲の単一の byte からなる.

source: The server MUST attempt to remove the public key for the user from the appropriate location, so that the public key cannot be used for subsequent authentications.
ja: サーバは, 以降の公開鍵認証で公開鍵が利用不可能になるよう適切な場所からユーザの公開鍵を削除しようと試みなければならない.

source: Implementations may also allow configuring more such mechanisms.
ja: 実装は, このようなメカニズムをさらに設定することを許してもよい.

source: When using ecdh_sha2_nistp256, each exponent used in the key exchange must have 256 bits of entropy.
ja: ecdh_sha2_nistp256 を用いる場合, 鍵交換時に利用するそれぞれの指数は 256 ビットのエントロピーを持たなければならない.

source: Such usage is vulnerable to man-in-the-middle attacks.
ja: このような利用の仕方は, 中間者攻撃に脆弱だ.

source: Secure Shell transfers data between the client and the server using its own binary packet structure.
ja: セキュアシェルは, 独自のバイナリパケット構造を用いてクライアントとサーバの間でデータを転送する.

source: Also note that the keystream can be pre-computed and that encryption is parallelizable.
ja: さらに注意: 鍵ストリームは前処理でき, 暗号化は並列化できる.

source: o V_S is S's version string, and V_C is C's version string
ja: o V_S は Sのバージョン文字列, V_C は Cのバージョン文字列だ.

source: As stated in Section 2.4, we mandate the use of secure methods for lookup and that SSHFP RRs are authenticated by trusted SIG RRs.
ja: 2.4節で述べたように, 検索に安全な方法を使われ, SSHFP RRが信頼できる SIG RR で認証されることが要求される.

source: request-specific data follows
ja: 要求特有のデータが続く.

source: Additional authentication methods are described in separate documents.
ja: 追加の認証法は別のドキュメントに記述される.

source: Authentication Method Names ...............................14 4.9.
ja: 認証法の名前 ...............................14 4.9.

source: It is up to the server's local policy to decide which methods (or combinations of methods) it is willing to accept for each user.
ja: それぞれのユーザに対して受け入れる方法(ないし方法の組合せ)を決定するのは, サーバのローカルなポリシーに委ねられている.

source: This document should be read only after reading the Secure Shell architecture [1] and Secure Shell connection [4] documents.
ja: この文書は, セキュアシェルアーキテクチャ [1] と セキュアシェルコネクション [4] 文書を読んだあとに読むべきだ.

source: If the client wishes to list the known public keys, the client sends:
ja: クライアントが既知の公開鍵の一覧を取得したい場合, クライアントは以下を送る:

source: Security Considerations .........................................7 7.
ja: セキュリティの考察 .........................................7 7.

source: * If the resulting major_status code is GSS_S_COMPLETE and both the mutual_state and integ_avail flags are true, then the security context has been established, and processing continues with step 4.
ja: * 結果の major_status コードが GSS_S_COMPLETE で mutual_state と integ_avail フラグが共に trueなら, セキュリティコンテキストが確立された. ステップ4 から処理が続けられる.

source: Protocol Fields and Values .................................4 4.
ja: プロトコルのフィールドと値..............................4 4.

source: In accordance with Section 4.2.1.12 of [RFC5280], if the ExtendedKeyUsage extension is present, then the certificate MUST be used only for one of the purposes indicated.
ja: ExtendedKeyUsage 拡張が存在するなら, [RFC5280] の 4.2.1.12 節に従い, 証明書は, 指定された目的の1つにのみ利用されなければならない.

source: In the event that, during context establishment, a client's call to GSS_Init_sec_context() or a server's call to GSS_Accept_sec_context() returns a token along with an error status, the resulting "error token" SHOULD be sent to the peer using the following message:
ja: コンテキスト確立の間にGSS_Init_sec_context() のクライアントでの呼び出しか GSS_Accept_sec_context() のサーバでの呼び出しが, エラー状態付きのトークンを返した場合, 結果の"エラートークン"を 次のメッセージを用いて相手に伝える必要がある.

source: The SSH Transport Model queries the SSH engine, in an implementation-dependent manner, to determine the address the message originated from, the user name authenticated by SSH, and a session identifier.
ja: SSH トランスポートモデルは, SSHとセッション識別子を用いてメッセージの送り元のアドレスと認証されたユーザ名を決定するために, 実装に依存する方式で, SSH エンジンを照会する.

source: This MIB module is for monitoring SSH Transport Model information.
ja: この MIB モジュールは SSH トランスポートモデルの情報をモニタするのが目的だ.

source: "command-override" specifies a command to be executed when this key is in use.
ja: "command-override" は, この鍵が使われるときに実行されるコマンドを指定する.

source: The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this document are to be interpreted as described in [RFC2119].
ja: この文書でのキーワード "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", "OPTIONAL" は, [RFC-2119] で記述されているように解釈される.

source: 50 ISIG Enable signals INTR, QUIT, [D]SUSP.
ja: 50 ISIG INTR, QUIT, [D]SUSP シグナルを有効にする.

source: This section contains conventions used in naming the namespaces, the initial state of the registry, and instructions for future assignments.
ja: この節は, 名前空間を命名規約や, レジストリの初期状態, 将来の割り当てに対する指示を含んでいる.

source: A line that is not a continuation line that has no ':' in it is the first line of the base64-encoded body.
ja: ':' を含まない継続行でない行は, base64 エンコードされた本体の最初の行だ.

source: RSA Key Exchange for the Secure Shell (SSH) Transport Layer Protocol
ja: セキュア シェル (SSH) トランスポート層プロトコルのための RSA 鍵交換

source: SSH MUST NOT be configured to skip public-key verification for use with the SSH Transport Model.
ja: SSH を SSH トランスポートモデルで利用する際に 公開鍵の検証をスキップするように設定してはならない.

source: Names .....................................................12 4.6.1.
ja: 名前..................................................12 4.6.1.

source: Both the server and the client should check whether the underlying transport layer provides confidentiality (i.e., if encryption is being used).
ja: サーバとクライアントは, 基盤となっているトランスポート層が機密性を提供するかどうか(すなわち, 暗号化が使われているかどうか)をチェックしなければならない.

source: The username provided by the SSH implementation will be made available to the NETCONF message layer as the NETCONF username without modification.
ja: SSH 実装から提供されるユーザ名は, NETCONF ユーザ名として変更なしで NETCONF メッセージに利用できる.

source: underlying block cipher and the length of the encrypted packets, the first recommendation may supersede the second recommendation, or vice versa.
ja: 注意: 基底にあるブロック暗号のブロックサイズと暗号化されたパケットの長さに依存して, 1番目の推奨が2番目の推奨を上書きするかもしれない. また逆もある.

source: MIB Module Definition
ja: MIB Module の定義

source: The receiving side must decide whether to allow the forwarding.
ja: 受信した側は転送を受け入れるか決めなければならない.

source: The SSH protocol requires the execution of CPU-intensive calculations to establish a session key during session establishment.
ja: SSH プロトコルは, セッションの確立時にセッション鍵を作成するのにCPUをたくさん利用する計算の実行を必要とする.

source: Also note that although compressing payload data before encrypting and MACing and the use of random padding may reduce the risk of information leakage through the underlying MAC, compression and the use of random padding will not prevent information leakage.
ja: さらに注意: 暗号化とMACの前の圧縮やランダムなパディングの利用は基底のMACからの情報漏洩のリスクを軽減するが, 圧縮やランダムなパディングの利用は情報漏洩を防ぐわけではない.

source: Naturally, if the server does not understand the proposed 'channel type', even if it is a locally defined 'channel type', then the 'reason code' MUST be 0x00000003, as described above, if the 'reason code' is sent.
ja: もちろん, サーバが提案された 'channel type' を理解できない場合は, それがローカルに定義された 'channel type' であっても, 'reason code' は 前述した0x00000003 でなければならない.

source: This algorithm number octet describes the algorithm of the public key.
ja: アルゴリズム番号のオクテットは, 公開鍵のアルゴリズムを記述する.

source: ECMQV requires that all the keys used to generate a shared secret are generated over the same elliptic curve domain parameters.
ja: ECMQV は, 共有の秘密を生成するのに使われるすべての鍵が同じ楕円曲線ドメインパラメータで生成されていることを要求する.

source: + If openSession fails, then discard the message, release tmStateReference, and pass the error indication returned by openSession back to the calling module.
ja: + openSession が失敗したら, メッセージを捨て, tmStateReference を開放し, openSession から返されたエラー表示を呼び出し元モジュールに渡す.

source: Debug Message ............................................26 11.4.
ja: デバッグメッセージ...............................26 11.4.

source: The family of SSH key exchange method names beginning with "gss- gex-sha1-" and not containing the at-sign ('@'), to name the key exchange methods defined in Section 2.5.
ja: "gss-gex-sha1-" で始まり アットマーク('@')を含まないSSH 鍵交換法名のファミリで 2.5節で定義した鍵交換法を指定する.

source: The appropriate security considerations of that document apply.
ja: この文書の適切なセキュリティの考察が適用される.

source: Many UNIX machines, for example, normally display text from /etc/issue, use TCP wrappers, or similar software to display a banner before issuing a login prompt.
ja: 例えば, 多くのUNIXマシンは, ログインプロンプトを表示する前に, 通常 /etc/issue からのテキストを表示したり, TCP wrappers や似たソフトウェアを用いてバナーを表示する.

source: 30 IGNPAR The ignore parity flag.
ja: 30 IGNPAR パリティ無視フラグ.

source: Key re-exchange is started by sending an SSH_MSG_KEXINIT packet when not already doing a key exchange (as described in Section 7.1).
ja: 鍵の再交換は, (7.1 節で記述した) 鍵交換をまだ行なっていない場合にも送られる SSH_MSG_KEXINIT パケットの送信によって始められる.

source: If a client does not honor the echo field for whatever reason, then the client MUST err on the side of masking input.
ja: クライアントが何らかの理由で echo フィールドを尊重しない場合は, クライアントは入力を隠さなければならない.

source: The Public Key Subsystem protocol is designed for extreme simplicity in implementation.
ja: この公開鍵サブシステムプロトコルは, 非常に簡単に実装できるよう設計されている.

source: Implementers of protocols and applications running on top of this protocol should keep this possibility in mind.
ja: このプロトコルの上で動くプロトコルとアプリケーションの実装者は, この可能性を肝に銘じておくべきである.

source: Whatever choice is made must be applied and enforced as required above.
ja: どの選択がされようとも, 前述したように正しく適用され実施されなければならない.

source: The server MAY fail the otherwise valid gssapi-with-mic authentication if per-message integrity protection is not supported.
ja: メッセージ単位の完全性保護がサポートされていない場合に, サーバは正当な gssapi-with-mic 認証を失敗させてもよい.

source: It may also provide compression.
ja: さらに, 圧縮も提供できる.

source: The SSH client will then invoke the "ssh-userauth" service to authenticate the user, as described in the SSH
ja: クライアントは SSH 認証プロトコル [RFC4252] に記述されているようにユーザを認証するため "ssh-userauth" サービスを起動する.

source: Special care should be taken to ensure that all of the random numbers are of good quality.
ja: すべての乱数がよい質であることを保証する特別な注意が払われなければならない.

source: All implementations MUST be able to process this message; they SHOULD be able to send this message.
ja: すべての実装は, このメッセージを処理できなければならない; すべての実装はこのメッセージを送信可能である必要がある.

source: The "ecdsa-sha2-*" key formats all have the following encoding:
ja: "ecdsa-sha2-*" 鍵フォーマットは, すべて次のようなエンコーディングを持つ:

source: These flags SHOULD be set to "false".
ja: これらのフラグは "false" に設定する必要がある.

source: string Sig_S // an octet string containing the server's // signature of the newly established exchange // hash value
ja: string Sig_S // 新しく確立された交換ハッシュのサーバの署名を含むオクテット文字列

source: The exchange hash SHOULD be kept secret.
ja: 交換ハッシュは秘密にする必要がある.

source: Use over TCP/IP
ja: TCP/IP上での利用

source: However, there are some places where such data might be passed.
ja: しかしながら,そのようなデータが扱われる場所がいくつかある.

source: If the BREAK length cannot be controlled by the application receiving this request, the BREAK length parameter SHOULD be ignored and the default BREAK signal length of the chipset or underlying chipset driver SHOULD be sent.
ja: この要求を受けるアプリケーションが BREAK の長さを制御できないなら, BREAK length パラメータは, 無視される必要がある. チップセットや基盤となるチップセットのドライバのデフォルトの BREAK シグナルの長さが送られなければならない.

source: This memo describes a Transport Model that permits SNMP to utilize SSH security services.
ja: このメモは SSH セキュリティサービスの利用を SNMP に許すトランスポートモデルを記述する.

source: Additional key types may be defined, as specified in [SSH-ARCH] and in [SSH-NUMBERS].
ja: 追加の鍵の種類が, [SSH-ARCH] や [SSH-NUMBERS] で定義されるかもしれない.

source: Encryption Modes ................................................3 5.
ja: 暗号モード ................................................3 5.

source: Given some elliptic curve domain parameters, an ECC key pair can be generated containing a private key (an integer d), and a public key (an elliptic curve point Q).
ja: いくつかの楕円曲線ドメインパラメータより, 秘密鍵(整数 d) と公開鍵(楕円曲線上の点 Q)を含む ECC鍵ペアが生成される.

source: Section 9 of [RFC4253] suggests that SSH implementations rekey after every gigabyte of transmitted data.
ja: [RFC4253] の 9節は, 転送データ1GBごとにSSHの実装が鍵を再生成するよう示唆している.

source: Terminating null characters MUST NOT be used, neither for the individual names, nor for the list as a whole.
ja: 終端のnull文字は, 個別のnameにも, リスト全体にも, 使ってはならない.

source: The 'error message' contains an additional textual explanation of the error message.
ja: 'error message' は, 追加のエラーメッセージのテキストでの説明が含まれる.

source: snmpSshtmSessionOpens OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION "The number of times an openSession() request has been executed as an SSH client, whether it succeeded or failed.
ja: snmpSshtmSessionOpens OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION "成功/失敗に関わらず, SSH クライアントとして openSession() 要求が実行された回数

source: Adding a Public Key .
ja: 公開鍵の追加 .

source: Q is the public key encoded from an elliptic curve point into an octet string as defined in Section 2.3.3 of [SEC1]; point compression MAY be used.
ja: Q は, [SEC1] の 2.3.3節で定義されているように, 楕円曲線上の点をオクテット文字列にエンコードした公開鍵だ; ポイント圧縮が利用されてもよい.

source: This could be done manually between the administrators or automatically using secure DNS dynamic update [11] between the SSH server and the nameserver.
ja: これは, 管理者間で手で行なうこともできるし, SSHサーバとネームサーバの間で安全なDNS 動的更新 [11] を使って自動的に行なうこともできる.

source: Implementations SHOULD try to make the best effort to check host keys.
ja: 実装は, ホスト鍵を検査する最大限の努力を払う必要がある.

source: All implementations MUST support this method; however, not all users need to have public keys, and most local policies are not likely to require public key authentication for all users in the near future.
ja: すべての実装は, この認証法をサポートしなければならない. しかし, すべてのユーザが公開鍵を持つ必要はない. また, 近い将来に多くのローカルなポリシーがすべてのユーザに対して公開鍵認証を要求することはないだろう.

source: SSH Terminology
ja: SSHの用語

source: This section describes a general-purpose user authentication method based on [GSSAPI].
ja: この節では， [GSSAPI]に基づく汎用の目的に利用できるユーザ認証法を記述する．

source: C sends e to S.
ja: C は S に e を送る.

source: The only REQUIRED authentication 'method name' is "publickey" authentication.
ja: 唯一実装を要求されている認証の 'method_name' が "publickey" 認証だ.

source: An earlier proposal for the use of X.509v3 certificates in the Secure Shell protocol was introduced by O. Saarenmaa and J. Galbraith; while this document is informed in part by that earlier proposal, it does not maintain strict compatibility.
ja: セキュアシェルプロトコルでの X.509v3 証明書の利用の以前の提案は, O. Saarenmaa と J. Galbraith によって導入された. この文書は以前の提案から一部を引き継いでいるが, 完全な互換性は維持していない.

source: Note that the -s option causes the command ("netconf") to be invoked as an SSH subsystem.
ja: 注意: -s オプションは, SSHのサブシステムとしてコマンド("netconf")を起動させる.

source: Initially, no MAC will be in effect, and its length MUST be zero.
ja: 最初は, MACは有効ではなく, その長さは 0 でなければならない.

source: If a host has keys at all, it MUST have at least one key that uses each REQUIRED public key algorithm (DSS [FIPS-186-2]).
ja: ホストが鍵を持つなら, 少なくとも, 必須の公開鍵アルゴリズム(DSS [FIPS-186-2])を用いる鍵を1つ持たなければならない.

source: S finds a group that best matches the client's request, and sends "p || g" to C.
ja: S はクライアントの要求に一番一致する群を見つけ C に "p || g" を送る.

source: A pseudo-terminal can be allocated for the session by sending the following message.
ja: 次のメッセージを送ることで, 擬似ターミナルがセッションに割り当てられる.

source: Note that the values given below are in decimal format for readability, but they are actually byte values.
ja: 以下で示す値は, 読み易いように10進のフォーマットで書かれているが. 実際には byte の値であることに注意.

source: All channel-specific requests use the following format.
ja: すべてのチャンネル特有の要求は次の形式を用いる.

source: Rekeying .......................................................12 8.
ja: 鍵の再生成 .......................................................12 8.

source: In the figure above, the string [identifier] is the identifier of the elliptic curve domain parameters.
ja: 上の図で, 文字列 [identifier] は, 楕円曲線ドメインパラメータの識別子だ.

source: The tmSecurityName MUST be constant for all traffic passing through an SSHTM session.
ja: tmSecurityName は, SSHTM セッションを流れるすべてのトラフィックで一定でなければならない.

source: The password method allows for integration with a deployed password infrastructure, such as Authentication, Authorization, and Accounting (AAA) servers using the RADIUS protocol [RFC2865].
ja: パスワード法は, 例えば RADIUS プロトコル [RFC2865] を用いる 認証, 認可, 課金 (AAA) サーバのような, 配置済みのパスワード基盤と統合できる.

source: If the requested service is not available, the server MAY disconnect immediately or at any later time.
ja: 要求されたサービスが利用可能ではない場合, サーバはすぐに切断してもよいし後のいかなる時に切断してもよい.

source: For the most part, the security considerations involved in using the Secure Shell protocol apply, since all of the public key algorithms introduced in this document are based on existing algorithms in the Secure Shell protocol.
ja: この文書で導入されるすべての公開鍵アルゴリズムは、セキュアシェルプロトコルの既存のアルゴリズムに基づいているため, ほとんどの部分についてはセキュアシェルプロトコル利用上のセキュリティの考察が適用される.

source: Uncontrolled setting of environment variables in a privileged process can be a security hazard.
ja: 特権を持つプロセスで環境変数の設定を制御しないと, セキュリティの危険となりうる.

source: Signing and verifying using the x509v3-ecdsa-sha2-* key formats is performed according to the ECDSA algorithm in [FIPS-186-3] using the SHA2 hash function family [FIPS-180-3].
ja: x509v3-ecdsa-sha2-* 鍵フォーマットでの署名と検証は, SHA-2 ハッシュ関数ファミリ [FIPS-180-3] を用いる [FIPS-186-3] の ECDSA アルゴリズムに従って行なわれる.

source: Key Exchange Method Names ................................16 4.11.
ja: 鍵交換法の名前.................................16 4.11.

source: First Rekeying Recommendation ..............................3 3.2.
ja: 鍵の再生成についての1番目の推奨 ..............................3 3.2.

source: For example, one should not rely on an unprotected DNS record to map a host alias to the primary name of a server, or an IP address to a hostname, since an attacker can modify the mapping and impersonate the server.
ja: 例えば, 攻撃者がマッピングを変更したりサーバになりすますことができるので, ホストエイリアスをサーバのプライマリ名にマップしたりIPアドレスをホスト名にマップする保護されていない DNS レコードに依存してはならない.

source: At minLOS 128, either one of these methods may be used, but at minLOS 192, x509v3-ecdsa-sha2-nistp384 MUST be used.
ja: minLOS 128 の場合, これらのどちらかが利用できる. minLOS 192 の場合, x509v3-ecdsa-sha2-nistp384 が利用されなければならない.

source: Policy Issues
ja: ポリシーの問題

source: When performing SNMP processing, there are two levels of state information that may need to be retained: the immediate state linking a request-response pair and a potentially longer-term state relating to transport and security.
ja: SNMP の処理を実行する際, 保持される必要がある状態の情報には2つのレベルがある. リクエスト-レスポンスのペアにリンクする即時の状態と, トランスポートとセキュリティに関連する長期間保持される可能性のある情報だ.

source: The SSH_MSG_KEXECDH_REPLY contains the server's contribution to the ECDH exchange, the server's public signature key, and a signature of the exchange hash value formed from the newly established shared secret value.
ja: SSH_MSG_KEXECDH_REPLY は, ECDH に対するサーバの contribution や サーバの公開署名鍵, 新しく確立した共有秘密値から導出される交換ハッシュに対する ECDSA 署名が含まれる.

source: Additional methods may be defined as specified in [SSH-ARCH] and in [SSH-NUMBERS].
ja: 追加の方法が, [SSH-ARCH] や [SSH-NUMBERS] で定義されるかもしれない.

source: With AES-GCM, the 12-octet IV is broken into two fields: a 4-octet fixed field and an 8-octet invocation counter field.
ja: AES-GCM では, 12-オクテットの IVが2つのフィールドに分けられる: 4-octet の固定のフィールドと, 8-octet の呼び出しカウンタフィールドだ.

source: The SSH transport-layer algorithms used to provide authentication, data integrity, and encryption SHOULD NOT be exposed to the SSH Transport Model layer.
ja: 認証とデータの完全性, 暗号化を提供するのに用いられる SSH トランスポート層アルゴリズムは, SSH トランスポートモデル層に公開しないほうがよい.

source: Similarly, if a certificate indicates that OCSP is used and there is no response to the OCSP query, the absence of a response along with the details of the attempted certificate use (as before) SHOULD be logged.
ja: 同様に, 証明書が OCSP が利用されることを示していて OCSP クエリへの応答がない場合, 試行に用いられた証明書の利用の詳細(前述)とともに応答がないことが記録される必要がある.

source: The fingerprint is calculated over the public key blob as described in [7].
ja: [7] で記述された public key blob に対して計算されたものが指紋だ.

source: It is recommended to use 2 as generator, because it improves efficiency in multiplication performance.
ja: 2と生成器として利用するのが推奨される. 乗算のパフォーマンスが良いからだ.

source: Differences with RFC 1421 PEM Formats
ja: RFC 1421 PEM 形式との違い

source: It also assumes that the private key of the server host has not been compromised.
ja: さらに, サーバホストの秘密鍵も侵害されていないことも前提とする.

source: Taking Keys Into Use ......................................21 8.
ja: 鍵の利用...............................21 8.

source: "env" specifies that session channel "env" requests should be denied when this key is in use.
ja: "env" は, この鍵を用いるとセッションチャンネルの "env" 要求が拒否されることを指定する.

source: It also discusses the SSH algorithm naming system that allows local extensions.
ja: さらに, ローカルな拡張を許可しているSSH アルゴリズムの命名規則も議論している.

source: o Integrated errata verified for RFC 4742 as of the date of publication of this document.
ja: o この文書の発行日現在の RFC 4742 に対して検証された正誤表を統合した.

source: This would help prevent an attacker from injecting a DNS search path into the local resolver and forcing the client to connect to a different host.
ja: これにより, ローカルなリゾルバにDNS検索パスを挿入して他のホストにクライアントを接続させようとする攻撃を防ぐ.

source: This transport can be used for any NETCONF message.
ja: このトランスポートは, 任意の NETCONF メッセージに利用できる.

source: Motivation .................................................5 1.5.
ja: 動機 .................................................5 1.5.

source: Stored as eight bytes in the order of decreasing significance (network byte order).
ja: 位が降順の8byteの値として格納される(ネットワークバイトオーダー)

source: Additional user authentication methods MAY be used, but only after the certificate-based ECDSA authentication has been successfully completed.
ja: 追加のユーザ認証法が用いられてもよい. しかし, 証明書ベースの ECDSA 認証が正常に完了した後でのみ用いられなければならない.

source: The Arcfour cipher is believed to be compatible with the RC4 cipher [SCHNEIER].
ja: Arcfour 暗号は, RC4 暗号 [SCHNEIER] と互換すると考えられている.

source: The "byte", "boolean", "uint32", and "string" data types are defined in [3].
ja: "byte" や "boolean", "uint32", "string" データタイプは [3] で定義されている.

source: Secure Shell (SSH) [RFC4251] is a secure remote-login protocol.
ja: セキュア シェル(SSH) [RFC4251] は 安全なロモートログインプロトコルだ.

source: The following public key and/or certificate formats are currently defined:
ja: 次の公開鍵と/ないし証明書のフォーマットが現在定義されている:

source: statusInformation = openSession( IN tmStateReference -- transport information to be used OUT tmStateReference -- transport information to be used IN maxMessageSize -- of the sending SNMP entity )
ja: statusInformation = openSession( IN tmStateReference -- 利用されるトランスポート情報 OUT tmStateReference -- 利用されるトランスポート情報 IN maxMessageSize -- 送信するSNMP エントリの最大メッセージ長 )

source: The Public Key Subsystem is started by a client sending an SSH_MSG_CHANNEL_REQUEST over an existing session's channel.
ja: 公開鍵サブシステムは, すでに開始されているセッションチャンネル上で SSH_MSG_CHANNEL_REQUEST をクライアントが送ることで開始される.

source: This constraint MUST be enforced, even when using stream ciphers.
ja: この制限は, たとえストリーム暗号を用いる場合にも実施されなければならない.
